Repository: mozilla-l10n/mt-training-data
Catalog: hno/hno_pontoon.tmx
Source language: en_us
Languages: hno

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
hno: اے زباناں ہجّاں کمیونٹی ترقی دے مرحلے بچ ہن۔ <localizationGlossaryLink>ویب سائٹ دی مقامیت</localizationGlossaryLink>تے<sentenceCollectionGlossaryLink>جملے جمع کرنا</sentenceCollectionGlossaryLink>دی ضرورت ہے، اناں کو لانچ کرنا آستے۔

source: The selected file is too large
hno: چُنری دی فائل مُچ بڑی ہے

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
hno: جملے جمع کرن آلا بنیادی کامن وائس پلیٹ فارم دی طرف جلدا ہے۔ ہونڑ تسیں ہک جملہ<writeURL>لکھ</writeURL>ہکدے ہو یا <reviewURL>جائزہ</reviewURL>گِِھن ہکدے ہو، ہک جملہ کّٹھا کر سکدے ہو۔

source: The sentence has a grammatical or spelling error.
hno: جملے بچ گرائمر یا اِملا دی غلطی ہے۔

source: The sentence has disrespectful or offensive language.
hno: جملے بچ بےعزتی والی یا ناشائستہ زبان ہے۔

source: The sentence must be grammatically correct.
hno: جملے دی گرائمر ٹھیک ہونڑا ضروری ہے۔

source: The sentence must be speakable.
hno: جملہ بولنڑا دے قابل ہونڑا ضروری ہے۔

source: The sentence must be spelled correctly.
hno: جملے دی املا ٹھیک ہونڑا ضروری ہے۔

source: The sentence should have fewer than 15 words.
hno: جملے بچ 15 کولو گھٹ لفظ ہونڑے چاہیدے ہن۔

source: The site is ready to be launched when it reaches 75% completion.
hno: جڑے ویلے سائٹ%75 مکمل ہوندے اے تے اُس ویلے اُو لانّچ واسطے تیار ہے۔

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
hno: جتنا جلدی ہو سکا سائٹ دا بیک اپ ہوسی۔ تازی معلومات واسطے، براہ مہربانی<matrixLink>میٹرکس کمیونٹی چیٹ</matrixLink> بچ شامل ہوؤ یا <githubLink> GitHub </githubLink> تے جُلو، یا<discourseLink> اسدے ڈسکورس فورمز</discourseLink> تے، سائٹ دے تجربے بارے مسائل جمع کرالنے یا نگرانی آستے۔

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
hno: TED-LIUM کارپس آڈیو ٹاکس نال بنڑایا دا آسا تے اس دی ٹرانسکرپشنز TED ویب سائٹ تے دستیاب ہے۔

source: The website text is translated into that language.
hno: اس ویب سائٹ دی عبارت دا ترجمہ اس زبان بچ کیتا دا ہے۔

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
hno: اس متن بچ ذاتی طور تے شناخت دے قابل معلومات ہے، کسی دی شناخت دے متعلق اے، جسطرح اُسدا ناں، ای میل ایڈریس، ایریا، شناختی نمبر، یا فون نمبر ہے۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
hno: ایہ معلومات دینڑی آپشنل ہے-تسیں اے صرف اِس صورت دیو جدوں تسیں آرام دہ ہُوؤ۔ جدوں اسیں ڈیٹا سیٹ جاری کردے آں، تے اسیں ساری ذاتی معلومات دا تخلص کردے آں، ہور اس گل کو یقینی بنڑیدے آں کہ تسدی ناں ہور ای میل دی معلومات آبادی دی معلومات نال نہ جُڑی ہوا جسطرے عمر یا جنس دی معلومات۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
hno: اے معلومات دینڑا (تسدا) اخیتار اے-تُسیں اے صرف اس ویلے دیو جدّوں تُساں ٹھیک لگے۔ جدوں اسیں ڈیٹا سیٹ جاری کرساں، اسیں ساری معلومات کو دوئے ناں دیساں تے اس گَل کو یقینی بنڑیساں کہ تسدے ناں ہور ای میل دی معلومات آبادیاتی معلومات جِیاں کہ عمر یا جنس نال ناں جڑی ہوّا۔ جی ٹِکنالوجی ہر ہِکّا آسطے کم کرّے، بنڑیڑاں آلےاں کو ٹکنالوجی بنڑیڑاں آسطے اُو ڈیٹا مدد کردا اے جِڑّا مُچ قِسماں دے لوگاں کو دَسّاں۔ میٹا ڈیٹا کِیاں ضروری اے اس بارے ہور سِکھو۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
hno: ایہ ہک یوز کیس ڈریون حصہ ہے جس بچ سپوکن ڈجّٹ ریککنیشن ہور ہاں /ناں دا پتہ لینڑا دا ڈیٹا ہے۔

source: This is how you cite yourself if you wrote the content yourself.
hno: اگر تساں مواد خود ہی لکھیا تے آپنڑاں حوالہ اس طرح دیسو۔

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
hno: اے منصوبہ تُسّاں جِیّاں لوکاں دی مدد بغیر ممکن نہ ہوسی۔ 🎉 کامن وائس وچ شامل ہونڑا دے مُچ طریقے ہن- تُسّاں کو اے جانڑنا دی ضرورت نیں کہ حصہ بینڑا آسطے کوڈ کے اے!

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
hno: اے ترتیب تسدے لیڈر بورڈ مرئیت کو کنٹرول کردی ہے۔ جدوں ظاہر نہ ہوے، تسدی بڑھوتری نجی ہوسے۔ اس دا مطلب ہے کہ تسدی تصویر، صارف دا ناں تے ترقی لیڈر بورڈ تے ظاہر نہ ہوسی۔ لِکھو کہ لیڈر بورڈ ریفریش بچ تبدیلیاں کو ہونڑا بچ ~{ $minutes } منٹ لڳدے ہن۔

source: Three to go!
hno: تِرے باقی ہن!

source: Thur
hno: تھور

source: Tibetan
hno: تبتی

source: Tigre
hno: ٹیگری

source: Tigrinya
hno: ٹيگرنيا

source: Tlazoyaltepec Mixtec
hno: ٹلیزویلٹیپک مکسٹک

source: Toba Qom
hno: ٹوبہ قم

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
hno: آپنڑٰی ای میل بچ تبدیلی یا ایڈٹ کرنا آسطے اساں کو <emailFragment>commonvoice@mozilla.com</emailFragment>تے ای میل بھیجو

source: Today
hno: اجّ

source: Today's Common Voice progress on clips recorded
hno: ریکارڈ کیتے دیاں کلپاں تے اج دی کامن وائس پیش رفت

source: Today's Common Voice progress on clips validated
hno: تصدیق کیتے دیاں کلپاں تے اج دی کامن وائس پیش رفت

source: Today's Progress
hno: اجّ دی پراگرس

source: Toki Pona
hno: ٹوکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
hno: کامن وائس دے ڈیٹا سیٹ بچ شامل ہونڑا واسطے، ہک آواز دے کلپ کو دو علحدہ علحدہ استعمال کرنیاں والیاں دی تصدیق ضروری ہے۔

source: Too many files
hno: مُچ ساریاں فائلاں

source: Top Contributors
hno: اہم تعاون کرنا آلے

source: Torwali
hno: توروالی

source: Total
hno: کل

source: Total Approved
hno: سارے منظور ہوئے دے

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
hno: { $totalHours } گھنٹے قابل حصول ہن صرف{ $periodMonths } مہینیاں بچ جی اگر{ $people } بندے ریکاڈ کرن،ہر روز { $clipsPerDay } کلپ۔

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
hno: سجے پاسے اسیں فائدیاں دا نقشہ پیش کردے ہاں ہور واضح کردے ہاں کڑی معلومات اسیں عام کردے ہاں۔ اپنڑی ڈیوائس تے کامن وائس دا اکاؤنٹ نال شروع کرنا کیتے تلہ دتیا دا لنک استعمال کرو۔

source: Toward next goal
hno: دوئے مقصد دی طرف

source: Track progress here and on your stats page.
hno: اتھا ہور اپنڑے اعدادوشمار دے صفحے تے پیشرفت دا پتہ کرو۔

source: Transcribe
hno: نقل کرو

source: Transcribe answers
hno: جواباں کو ٹرانسکرائب کرو

source: Transcribe Audio
hno: آواز کو ٹرانسکرائب کرو

source: Transcribe audio recordings into text
hno: آواز دی ریکاڈنگ کو عبارت بچ ٹرانسکرائب کرو

source: Transcribe audio recordings in your language
hno: اپنڑی زبان بچ آڈیو ریکاڈنگ کو ٹرانسکرائب کرو

source: Transcribe Audio <small>(Coming soon)</small>
hno: آڈیو ٹرانسکرائب کرو<small>(جلدی آ ری اے)</small>

source: Transcript edited successfully
hno: ٹرانسکرپٹ کامیابی نال درست ہویّا۔

source: Transcript skipped successfully
hno: ٹرانسکرپٹ کامیابی نال چُھوڑیا۔

source: Transcript submitted successfully
hno: ٹرانسکرپٹ کامیابی نال جمع ہویّا

source: Transcript voted successfully
hno: ٹرانسکرپٹ کامیابی نال ووٹ ہویّا۔

source: Transgender
hno: ٹرانسجینڈر

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
hno: <translateVideoLink>پونٹون کو کس طرح استعمال کرنا ہے اس واسطے اسدی گائیڈ دکھو۔</translateVideoLink>

source: Translating the site
hno: سائٹ دا ترجمہ کرنا

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
hno: ترجمہ انگریزی تو ہے۔ لیکن تسیں دویاں زباناں بچ<strong>تجویزاں</strong> دکھ ہکدے ہو۔ <strong>پروفائل</strong> آئیکن تے کلک کرو، فر<strong>ترتیباں</strong> دے لنک تے، ہورشامل کرو جڑی کوئی زبان تسیں بولدے ہو۔ تلہ سجے ہتھ کونے تے ترجمے دی ہک فہرست ہوسی اُسکو <strong>مقامی</strong>اکھدے ہن۔ ترجمے سائٹ تے ہک دن تو بعد دِستے ہن۔

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
hno: کامن وائس سائٹ دا ترجمہ <strong>پونٹون</strong> تے ہوندا ہے۔

source: Try again by dragging your file here
hno: دوبارہ کوشش کرو اپنڑی فائل کو اتھا آنڑنا نال

source: Try uploading again
hno: دوبارہ اپلوڈنگ دی کوشش کرو

source: Tshivenda
hno: شیوِنڈا

source: Tunen
hno: ٹیونن

source: Tupuri
hno: ٹپوری

source: Turkish
hno: ترکی

source: Turkmen
hno: ترکمانی

source: Tush
hno: توش

source: Tuvan
hno: تُووان

source: Twi
hno: توی

source: Typically megabytes
hno: عام طور تے میگا بائٹس

source: Ubykh
hno: اُبیکھ

source: Udmurt
hno: اُڈمورت

source: Ukrainian
hno: یوکرائنی

source: Understand contribution criteria
hno: حصے دا معیار سمجھو

source: Understand how to contribute and validate sentences and audio clips to the Common Voice dataset
hno: کامن وائس ڈیٹا سیٹ بچ کسطرح حصہ بینڑا تے جملیاں دی توثیق ہور آواز دے کلپس دینڑے ہن کو سمجھو

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
hno: سمجھو جدوں آواز دے کلپس سنڑدے ہو تے کِڑیاں چیزاں کو دکھنڑا ہور اپنڑی آواز دی ریکارڈنگ مزید اچھا بنڑانڑا بچ مدد کرو!

source: Universities, Academics and Researchers
hno: یونیورسٹیاں، ماہرین تعلیم تے محققین

source: Upload aborted. Do you want to delete your recordings?
hno: اپ لوڈ منسوخ کر چُھڑی، تسیں آپنڑی رکاڈنگ جاری رکھنڑا چہندے ہو؟

source: Upload an image file
hno: تصویر فائل اپ لوڈ کرو

source: { $uploadedQuestions } of { $totalQuestions } questions collected
hno: { $uploadedQuestions }دے{ $totalQuestions } سوال جمع ہوئے

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
hno: { $uploadedQuestions } دا { $totalQuestions } دے سوال جمع ہوئے۔ سوال کسطرح جمع کرنے ہن واسطے مزید جانڑنا آسطے اسدیاں<guidelinesLink> ہدایتاں</guidelinesLink> دے صفحے دیخو

source: { $uploadedSentences } of { $totalSentences } sentences collected
hno: { $uploadedSentences }دے { $totalSentences }جملے جمع ہوئے

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
hno: { $uploadedSentences }دے{ $totalSentences }جملے جمع ہویے۔ مسترد شدہ جملے ڈاؤنلوڈ کیتے <downloadLink>اِتھا</downloadLink>کلک کرو۔

source: Upload failed, please retry.
hno: اپلوڈ ناکام ہویا، مہربانی نال دوبارہ کوشش کرو۔

source: Upload <icon></icon> public domain sentences
hno: <icon></icon> عوامی ڈومین دے جملے اپلوڈ کرو

source: Upload in progress...
hno: اپلوڈ ہو رہیا ہے۔۔۔

source: Upload more sentences?
hno: مزید جملے اپلوڈ کرّاں؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
hno: اے کلپ سرور تے اپلوڈ نیں ہو رہیا۔ صفحہ دوبارہ لوڈ کرو یا بعد بچ کوشش کرو۔

source: Upload of this clip keeps failing, keep retrying?
hno: اے کلپ اپلوڈ نیں ہو رہیا، کوشش کردے رو؟

source: Urdu
hno: اُردو

source: Use correct grammar
hno: صحیح گرائمر استعمال کرو

source: Use correct spelling and grammar
hno: درست ہجے تے گرامر استعمال کرو

source: Use correct spelling and punctuation
hno: دُرست ہجے تے رموز اوقاف استعمال کرو

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
hno: <mark>آسطے فائدے مند اے، اصلی تقریر دا حوالہ</mark> تے استعمال دے کیس (مثال دے طور تے، جدوں تسیں چہندے او کہ سپیچ ریکگنیشن بغیر لکھے دے ہور عام طور تے گل کرنا آلےاں لوگاں نال کم کرا )

source: User Name
hno: استعمال کرنا آلے دا ناں

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
hno: استعمال کرنا آلےعطیہ شدہ کلپس دے ٹھیک ہونڑا دی توثیق کردے ہن، اے دکھتے کہ بولنا والیاں سنڑ جملیاں کو صحیح طرح پڑھیا دا ہے۔

source: Ushojo
hno: اُشوجو

source: Uyghur
hno: یغور

source: Uzbek
hno: اُزبک

source: Validated Clips
hno: تصدیق شدہ کلپس

source: Validated Hours
hno: تصدیق شدہ گھنٹے

source: Validated Hr. Total
hno: ایچ آر ٹوٹل تصدیق کیتا دا

source: Validate readings
hno: پڑھن دی تصدیق کرو

source: Validate Readings
hno: پڑھن دی تصدیق کرو

source: Validate Readings, Review Transcriptions
hno: پڑھن دی تصدیق کرو، ٹرانسکرپشن دا جائزہ گھنو

source: Validate Readings <small>(Coming soon)</small>
hno: پڑھنا دی تصدیق کرو<small>(جلدی آ ری اے)</small>

source: Validate readings submitted by community members
hno: کمیونٹی ممبراں دے جمع کرالے دے پڑھن دی تصدیق کرو

source: Validate user-recorded readings in your language
hno: اپنڑی زبان بچ پڑھن آلیاں دے پڑھے دی تصدیق کرو

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
hno: عطیہ کیتے کلپاں دی توثیق بھی کامن وائس مشن آستے برابر اہمیت رکھدی ہے۔ سنڑو تے ہچھا اوپن سورس وائس ڈیٹا بڑینڑا واسطے اسدی مدد کرو۔

source: Validation Progress
hno: تصدیق دی پیش رفت

source: Validations
hno: تصدیقاں

source: Value and recognition.
hno: قدر ہور پہچانڑ

source: Variant Contribution Options
hno: لہجے بارے حصہ بانڑے دے آپشن

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
hno: لہجے زبان دی ہک خاص شکل ہن۔ مثال دے طور تے ہک ایریے بچ یا کمیونٹی بچ رہنڑا آلے شیئر کردے نے۔ کدے کدے اناں کو مقامی لہجے بھی آخدے ہن۔

source: Varying Pronunciations
hno: مختلف تلفظ

source: Venetian
hno: ونیتی

source: Version
hno: ورژن

source: Very common mistakes include:
hno: عام غلطیاں بچ شامل ہن:

source: Vietnamese
hno: ویتنامی

source: View your progress against personal and project goals.
hno: ذاتی تے منصوبے ہدفاں بارے آپنڑی پیش رفت دِکھو۔

source: Visible
hno: ظاہر

source: Visit our blog or write about us
hno: اسدے بلاگ تے جُلّو یا اسدے بارے لکھو

source: Voice clips are entered into a submission queue that readies them for listening.
hno: وائس کلپس جمع کرانڑ والی لینڑ بچ چلے جلدے ہن او فر اناں کو سنڑنے واسطے تیار کردی ہے۔

source: Voice Collection
hno: آوازاں دا مجموعہ

source: Voice Contribution
hno: آوازاں دا تعاون

source: Voice Dataset, Ready for Download
hno: وائس ڈیٹا سیٹ، ڈاؤن لوڈ واسطے تیار ہے

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
hno: آواز قدرتی ہے، آواز انسانی ہے۔ اسی واسطے اسیں اپنڑیاں مشیناں واسطے استعمال دے قابل وائس ٹیکنالوجی بڑینڑا بارے پرجوش آں۔ پر وائس سسٹمز بڑینڑا واسطے، ڈولپرز کو ہک بہت بڑی تعداد بچ آواز دے ڈیٹے دی ضرورت ہے۔

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
hno: آواز قدرتی ہے، آواز انسانی ہے۔ اسی واسطے اسیں اپنڑیاں مشیناں واسطے استعمال دے قابل وائس ٹیکنالوجی بڑینڑا بچ مصروف آں۔ پر وائس ٹیکنالوجی بڑینڑا واسطے، ہک بہت بڑی تعداد بچ آواز دے ڈیٹے دی ضرورت ہے۔

source: Voices Online Now
hno: آوازاں ہونڑ آن لائن ہن

source: Voice Validation
hno: زبان دی توثیق

source: Volume
hno: والیم

source: Votic
hno: ووٹک

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
hno: VoxForge کو ٹرانسکرائبڈ سپیچ جمع کرنا واسطے بنڑایا گیا جس (ٹرانسکرائبڈ سپیچ) کو مفت تے کھلا ماخذ سپیچ ریکگنیشن انجنز نال استعمال ہوسی۔

source: Wakhi
hno: واخی

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
hno: کامن وائس کو ہور اچھا کرنا واسطے مدد کرنا چہندے ہو؟ بہترین! ای میل یا <discourseLink>گل بات</discourseLink>فورمز دے ذریعے رابطے بچ رہیو، <githubLink>گٹھب </githubLink> دے ذریعہ سائٹ دے مسائل جمع کرالو، یا <matrixLink> میٹرکس </matrixLink> کمیونٹی دی گل بات بچ شامل ہو جلو۔

source: Want to save your information? <createProfile>Create a profile</createProfile>
hno: اپنڑی معلومات محفوظ رکھنڑا چہندے ہو؟<createProfile>ہک پروفائل بنڑاؤ</createProfile>

source: Want to stay in touch with Common Voice?
hno: کامن وائس نال رابطے بچ رہنڑا چہندے ہو؟

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
hno: اپڈیٹس چہندے ہو جدوں اسیں کامن وائس ڈیٹا سیٹ دا نیا ورژن کرساں؟ اسدا نیوز لیڑ سبسکرائب کرو۔

source: Watch our video explainer to help
hno: مدد واسطے اسدا وڈیو اکسپلینر دکھو

source: Wayuunaiki
hno: وایونائیکی

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
hno: اسیں ہمیشاں ڈیٹا کنزیومرز کولو ان دیاں ضرورتاں تے حوالے دے بارے بچ سنڑنا چہندے ہاں۔ ڈیٹا کٹھا کرنا دے پلیٹ فارم تے تعاون کرنا تو گھن کے ڈیٹا دی صحت بارے مشورے فراہم کرنا تک، اسیں <emailFragment> تساں کولو سنڑنا چہندے ہاں۔ </emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
hno: اسیں آوازاں دا ہک کھلا ہور عوامی طور تے دستیاب ڈیٹا سیٹ بنڑا رے ہاں جِڑا ہرکوئی سپیچ-انیبلڈ ایپاں دی ٹریننگ واسطے استمعال کر سکدا ہے۔

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
hno: اسیں ٹیکنالوجی، جدتّاں تے زبان دے حقوق بچ عوامی شعبے دی شمولیت دی حمایت بارے پرجوش ہاں۔ اگر تسیں کوئی بڑا منصوبہ یا مہم چلانڑا دی سوچ رے ہو، مہربانی نال <emailFragment>رابطے بچ رہیو۔</emailFragment>

source: We are going out to get a coffee.
hno: اسیں کافی گھننا واسطے باہر جَا رِہ ہاں۔

source: We are going out to get coffee.
hno: اسیں کافی گھننا واسطے باہر جَا رِہ ہاں۔

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
hno: اسیں لوکاں کو آپنڑی جنس یا صنفی شناخت دے بارے بچ جڑا کجھ او دسدے نے اس بچ مزید چوائس دینڑا آسطے مزید آپشن دیندے آں۔ مہربانی نال آپڑے آپ کو اس طرح دسیو جڑا تساں کو سچی بچ محسوس ہوندا اے۔ <learnMoreLink>جنس تے صنف بارے بچ استے نقطہ نظر بارے مزید جانڑیو۔</learnMoreLink>

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
hno: اسیں موزیلا بچ آواز دی ٹیکنالوجی دے گرد ہک برادری بنڑا رے ہاں۔ اسیں اپڈیٹاں، نئے ڈیٹا دے ماخذ نال رابطے بچ رہنڑا پسند کردے ہاں، ہور مزید سنڑناں چہندے ہاں کہ کسطرح تسیں اے ڈیٹا استعمال کر رے ہو۔

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
hno: اساں کو یقین ہے کہ بڑے ہور عوامی سطح تے دستیاب آواز دے ڈیٹا سیٹس مشین لرننگ تے مبنی تقریری ٹکنالوجی بچ جدت تے صحت مند تجارتی مقابلے کو فروغ دیسن۔ ایہ عالمی سطح دی ہک کوشش ہے ہور اسیں ہر ہکا کو اس بچ شامل ہونڑا دی دعوت دیندے ہاں۔ اسدا مقصد ہے کہ آواز تے مبنی ٹکنالوجی مزید جامع ہوے، دنیا بھر تو مختلف آوازاں دی عکاسی کرا۔

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
hno: اساں کو یقین ہے کہ بڑے، عوامی سطح تے دستیاب آواز دے ڈیٹا سیٹس مشین لرننگ تے مبنی تقریری ٹکنالوجی بچ جدت تے صحت مند تجارتی مقابلہ کو فروغ دیسن۔ کامن وائس دا کثیر لسانی ڈیٹا سیٹ اپنڑی نوعیت دا ساریاں تو بڑا عوامی طور تے دستیاب آواز دا ڈیٹا سیٹ ہے، لیکن اے اکیلا نیں۔ اس صفحے کو دوسرے اوپن سورس وائس ڈیٹا سیٹس دے حوالے دے مرکز دی حیثیت نال دکھو، ہور کامن وائس بچ اضافہ ہوندا رہندا ہے، اے جگہ ہے اسدی نئی معلومات دینڑا دی۔

source: Website Localization
hno: ویب سائٹ دی لوکلائزیشن

source: Websites
hno: ویب سائٹاں

source: We couldn’t find that page for you
hno: اسیں تُساں واسطے او صفحہ نہ ڈھونڈ ہکیاں۔

source: We couldn’t get any audio clips for you to listen to. Please try again later.
hno: اساں کو تسدے سنڑا واسطے آواز دے کوئی کلپس نیں مِلے۔ برائے مہربانی بعد بچ دوبارہ کوشش کرو۔

source: We couldn’t get any sentences for you to speak. Please try again later.
hno: اسیں تسدے بولنڑا واسطے کوئی جملہ نیں گھن ہکیاں۔بعد بچ دوبارہ کوشش کریو۔

source: Weekly
hno: ہفتہ وار

source: Weekly Goal
hno: ہفتے دے ہدف

source: We launch the Common Voice site in this language.
hno: اساں کامن وائس سائٹ کو اس زبان بچ شروع کیتا۔

source: Welcome { $company } staff!
hno: { $company }دے عملے کو ہرکدےآو!

source: Welcome to Common Voice
hno: کامن وائس تے ہر کدے آؤ

source: Welcome to Spontaneous Speech
hno: بے ساختہ تقریر بچ خوش آمدید

source: Welsh
hno: ویلش

source: We may have run out of clips - refresh the page, or try again later.
hno: اساں کول کلپس مک ہکدے ہن۔ صفحہ فر تازہ کرو، یا بعد بچ دوبارہ کوشش کرو۔

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
hno: ہو سکدا اے اساں کو او درخواست نہ ملے۔ مہربانی نال سدھا اساں کو <emailLink>{ $email }</emailLink> تے ای میل کرو تے اسیں تساں نال واپس رابطہ کرساں!

source: We periodically release the dataset
hno: اسیں وقفے وقفے ڈیٹاسیٹ جاری کردے اں

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
hno: اسیں وعدہ کردے ہاں کہ تسدی معلومات بڑی خیال نال برتساں۔ مزید اسدے<privacyLink>رازداری نوٹس</privacyLink>بچ پڑھو۔

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
hno: اسیں آوازاں دا ہک کھلا ماخذ، کثیر لسانی ڈیٹا سیٹ بنڑا رے ہاں جِڑا ہرکوئی سپیچ-انیبلڈ ایپاں دی ٹریننگ واسطے استمعال کر سکدا ہے۔
